from buscas import Buscas

busca = Buscas()

nodes = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V']
edges = [
    ('A', 'B'), ('A', 'C'), ('A', 'D'),
    ('B', 'A'), ('B', 'E'), ('B', 'F'),
    ('C', 'A'), ('C', 'G'), ('C', 'H'),
    ('D', 'A'), ('D', 'I'), ('D', 'J'),
    ('E', 'B'), ('E', 'K'), ('E', 'L'),
    ('F', 'B'), ('F', 'G'), ('F', 'L'), ('F', 'M'),
    ('G', 'C'), ('G', 'F'), ('G', 'M'),
    ('H', 'C'), ('H', 'N'),
    ('I', 'D'), ('I', 'N'), ('I', 'O'),
    ('J', 'D'),
    ('K', 'E'), ('K', 'P'),
    ('L', 'E'), ('L', 'F'), ('L', 'Q'), ('L', 'R'),
    ('M', 'F'), ('M', 'G'), ('M', 'R'), ('M', 'S'),
    ('N', 'H'), ('N', 'I'), ('N', 'T'),
    ('O', 'I'), ('O', 'T'),
    ('P', 'K'), ('P', 'U'),
    ('Q', 'L'), ('Q', 'U'),
    ('R', 'L'), ('R', 'M'), ('R', 'S'),
    ('S', 'M'), ('S', 'R'), ('S', 'V'),
    ('T', 'N'), ('T', 'O'), ('T', 'V'),
    ('U', 'P'), ('U', 'Q'), ('U', 'V'),
    ('V', 'S'), ('V', 'T'), ('V', 'U'),
]
edges_labels = {
    ('A', 'B'): 10, ('A', 'C'): 11, ('A', 'D'): 13,
    ('B', 'A'): 10,('B', 'E'): 14, ('B', 'F'): 14,
    ('C', 'A'): 11, ('C', 'G'): 10, ('C', 'H'): 10,
    ('D', 'A'): 13, ('D', 'I'): 10, ('D', 'J'): 10,
    ('E', 'B'): 14, ('E', 'K'): 11, ('E', 'L'): 14,
    ('F', 'B'): 14, ('F', 'G'): 10, ('F', 'L'): 12, ('F', 'M'): 14,
    ('G', 'C'): 10, ('G', 'F'): 10, ('G', 'M'): 10,
    ('H', 'C'): 10, ('H', 'N'): 10,
    ('I', 'D'): 10, ('I', 'N'): 10, ('I', 'O'): 10,
    ('J', 'D'): 10,
    ('K', 'E'): 11, ('K', 'P'): 10,
    ('L', 'E'): 14, ('L', 'F'): 12, ('L', 'Q'): 10, ('L', 'R'): 11,
    ('M', 'F'): 14, ('M', 'G'): 10, ('M', 'R'): 14, ('M', 'S'): 10,
    ('N', 'H'): 10, ('N', 'I'): 10, ('N', 'T'): 12,
    ('O', 'I'): 10, ('O', 'T'): 13,
    ('P', 'K'): 10, ('P', 'U'): 10,
    ('Q', 'L'): 10, ('Q', 'U'): 10,
    ('R', 'L'): 11, ('R', 'M'): 14, ('R', 'S'): 10,
    ('S', 'M'): 10, ('S', 'R'): 10, ('S', 'V'): 10,
    ('T', 'N'): 12, ('T', 'O'): 13, ('T', 'V'): 10,
    ('U', 'P'): 10, ('U', 'Q'): 10, ('U', 'V'): 21,
    ('V', 'S'): 10, ('V', 'T'): 10, ('V', 'U'): 21,
}
import collections


teste = [{"D": 20}, {"D": 31}, {"D": 14}, {"E": 5}, {"F": 8}, {"A": 1}]
teste2 = sorted(teste, key=lambda node: node[list(node.keys())[0]])

"""
    SUPOSIÇÃO PARA CHEGAR AO NÓ 'M'
"""


borda = [
    {"B": (10, "A")},
    {"C": (11, "A")},
    {"D": (13, "A")}
 ]

borda2 = [
    {"C": (11, "A")},
    {"D": (13, "A")},
    {"E": (24, "AB")},
    {"F": (24, "AB")},
]

borda3 = [
    {"D": (13, "A")},
    {"G": (21, "AC")},
    {"H": (21, "AC")},
    {"E": (24, "AB")},
    {"F": (24, "AB")},
]

borda4 = [
    {"G": (21, "AC")},
    {"H": (21, "AC")},
    {"I": (23, "AD")},
    {"J": (23, "AD")},
    {"E": (24, "AB")},
    {"F": (24, "AB")},
]

borda5 = [
    {"H": (21, "AC")},
    {"I": (23, "AD")},
    {"J": (23, "AD")},
    {"E": (24, "AB")},
    {"F": (24, "AB")},
    {"F": (31, "ACG")},
    {"M": (31, "ACG")},
]

borda6 = [
    {"I": (23, "AD")},
    {"J": (23, "AD")},
    {"E": (24, "AB")},
    {"F": (24, "AB")},
    {"F": (31, "ACG")},
    {"M": (31, "ACG")},
    {"N": (31, "ACH")},
]

borda7 = [
    {"J": (23, "AD")},
    {"E": (24, "AB")},
    {"F": (24, "AB")},
    {"N": (33, "ADI")},
    {"O": (33, "ADI")},
    {"F": (31, "ACG")},
    {"M": (31, "ACG")},
    {"N": (31, "ACH")},
]

borda8 = [
    {"J": (23, "AD")}, # aqui retira da lista e mata ele
    {"E": (24, "AB")},
    {"F": (24, "AB")},
    {"N": (33, "ADI")},
    {"O": (33, "ADI")},
    {"F": (31, "ACG")},
    {"M": (31, "ACG")},
    {"N": (31, "ACH")},
]

borda9 = [
    #{"J": (23, "AD")}, # aqui retira da lista e mata ele
    {"F": (24, "AB")},
    {"F": (31, "ACG")},
    {"M": (31, "ACG")},
    {"N": (31, "ACH")},
    {"N": (33, "ADI")},
    {"O": (33, "ADI")},
    {"K": (35, "ABE")},
    {"L": (38, "ABE")},
]

borda9 = [
    #{"J": (23, "AD")}, # aqui retira da lista e mata ele
    {"F": (31, "ACG")},
    {"M": (31, "ACG")},
    {"N": (31, "ACH")},
    {"G": (34, "ABF")},
    {"M": (38, "ABF")},
    {"N": (33, "ADI")},
    {"O": (33, "ADI")},
    {"K": (35, "ABE")},
    {"L": (38, "ABE")},
]

borda10 = [
    #{"J": (23, "AD")}, # aqui retira da lista e mata ele
    {"M": (31, "ACGM")},
    {"N": (31, "ACH")},
    {"N": (33, "ADI")},
    {"O": (33, "ADI")},
    {"G": (34, "ABF")},
    {"K": (35, "ABE")},
    {"M": (38, "ABF")},
    {"L": (38, "ABE")},
    {"B": (45, "ACGF")},
    {"M": (45, "ACGF")},
]
"""
    TERMINA AQUI E O CAMINHO RETORNADO É ACGM COM CUSTO DE 31
"""
teste2 = sorted(borda6, key=lambda node: node[list(node.keys())[0][0]])
busca.initial_node = "O"
busca.finish_node = "A"
busca.nodes = nodes
busca.edges = edges
busca.edges_coust = edges_labels
print(busca.nova_busca_dijkstra())